so.org
#+TITLE: Apuntes Sistemas Operativos 
#+LANGUAGE: es
#+LaTeX_HEADER: \usepackage[spanish]{inputenc}
#+SETUPFILE: /home/likcos/Materias/SO/theme-readtheorg-local.setup
#+EXPORT_FILE_NAME: index.html
#+OPTIONS: num:nil
#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
#+HTML_HEAD: <style>pre.src {background-color: #303030; color: #e5e5e5;}</style>


* Concepto de proceso
Un proceso es una unidad de ejecución dentro de un sistema
operativo. Cada proceso tiene su propio espacio de memoria, que
incluye el código del programa, sus datos y su pila. La creación de un
proceso implica varias operaciones del sistema operativo, como
asignación de memoria y registro en la tabla de procesos. Los procesos
permiten a los sistemas multitarea ejecutar múltiples programas de
forma aparentemente simultánea.


* Comandos para manejar procesos en Linux

** 1. Ver procesos activos
   - `ps`
     Muestra una lista de procesos en la terminal actual. Ofrece información sobre el PID, usuario, CPU, memoria, etc.
     - Ejemplo: `ps aux` muestra todos los procesos en ejecución en el sistema.

   - `top` 
     Muestra una lista dinámica de procesos en tiempo real, actualizándose constantemente. Incluye el uso de CPU, memoria, y estadísticas del sistema.
     - Comando alternativo: `htop`, que ofrece una interfaz más visual y personalizable.

   - `pgrep <nombre>`
     Busca el PID (Process ID) de un proceso específico por su nombre. Útil para obtener el PID antes de aplicar otros comandos.
     - Ejemplo: `pgrep apache` muestra el PID del proceso con el nombre "apache".

** 2. Iniciar procesos
   - `&` 
     Ejecuta un comando en segundo plano, permitiendo que el usuario continúe usando la terminal. 
     - Ejemplo: `comando &` ejecuta el proceso en segundo plano.

   - `nohup <comando> &`
     Inicia un proceso que continúa en ejecución incluso después de cerrar la terminal. El output se guarda en un archivo `nohup.out` por defecto.
     - Ejemplo: `nohup script.sh &` ejecuta `script.sh` y permanece activo tras cerrar sesión.

** 3. Controlar la ejecución de procesos
   - `fg` 
     Trae un proceso en segundo plano al primer plano, permitiendo interactuar directamente con él.

   - `bg`
     Envía un proceso suspendido al segundo plano, liberando la terminal para otros comandos.

   - `jobs`
     Muestra los procesos en segundo plano o suspendidos asociados a la sesión de terminal actual, con su ID de trabajo (job ID).

** 4. Enviar señales a los procesos
   - `kill <PID>` 
     Envía una señal de terminación al proceso especificado por su PID. Intenta cerrar el proceso de manera controlada.
     - Ejemplo: `kill 1234` termina el proceso con PID 1234.

   - `kill -9 <PID>`
     Fuerza el cierre inmediato del proceso especificado, sin esperar una terminación ordenada. Utiliza la señal `KILL`.
     - Ejemplo: `kill -9 1234`.

   - `pkill <nombre>`
     Termina todos los procesos que coinciden con el nombre especificado.
     - Ejemplo: `pkill apache` detiene todos los procesos con nombre "apache".

   - `killall <nombre>`
     Similar a `pkill`, detiene todos los procesos con un nombre específico.
     - Ejemplo: `killall httpd`.

** 5. Cambiar prioridad de procesos
   - `nice -n <prioridad> <comando>`
     Inicia un proceso con una prioridad especificada, donde el rango va de -20 (mayor prioridad) a 19 (menor prioridad). La prioridad afecta el orden de planificación.
     - Ejemplo: `nice -n -10 script.sh` ejecuta `script.sh` con una prioridad alta.

   - `renice <prioridad> <PID>`
     Cambia la prioridad de un proceso en ejecución.
     - Ejemplo: `renice -5 1234` ajusta la prioridad del proceso con PID 1234.

** 6. Ver detalles específicos de los procesos
   - `pstree`
     Muestra los procesos en una estructura de árbol, permitiendo visualizar mejor las relaciones y jerarquías entre procesos en ejecución.

   - `lsof -p <PID>`
     Lista todos los archivos abiertos por un proceso específico, útil para ver conexiones de red o archivos utilizados por un proceso.
     - Ejemplo: `lsof -p 1234` muestra los archivos abiertos por el proceso con PID 1234.



** Ejemplo en C: Creación de un proceso utilizando fork()
#+BEGIN_SRC C :results output
#include <stdio.h>
#include <unistd.h>
#include <sys/types.h>

int main() {
    pid_t pid = fork(); // Crear un nuevo proceso
    if (pid == 0) {
        printf("Soy el proceso hijo con PID %d\n", getpid());
    } else {
        printf("Soy el proceso padre con PID %d\n", getpid());
    }
    return 0;
}
#+END_SRC

#+RESULTS:
: Soy el proceso padre con PID 61713
: Soy el proceso hijo con PID 61714

