index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2024-10-29 mar 14:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Apuntes Sistemas Operativos</title>
<meta name="author" content="likcos" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Apuntes Sistemas Operativos</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbf9b282">Concepto de proceso</a></li>
<li><a href="#orgec91301">Comandos para manejar procesos en Linux</a>
<ul>
<li><a href="#org7b2f86f">1. Ver procesos activos</a></li>
<li><a href="#orgcca7250">2. Iniciar procesos</a></li>
<li><a href="#orgeb266fa">3. Controlar la ejecución de procesos</a></li>
<li><a href="#org9283f45">4. Enviar señales a los procesos</a></li>
<li><a href="#orgf3e8981">5. Cambiar prioridad de procesos</a></li>
<li><a href="#org648fa79">6. Ver detalles específicos de los procesos</a></li>
<li><a href="#org83bae99">Ejemplo en C: Creación de un proceso utilizando fork()</a></li>
</ul>
</li>
<li><a href="#orgce010df">Estados y transiciones de los procesos</a>
<ul>
<li><a href="#org8eeef8e">Ejemplo en C: Simulación de transiciones de estados</a></li>
</ul>
</li>
<li><a href="#orgcc24b89">Procesos ligeros: Hilos o hebras</a>
<ul>
<li><a href="#org17e2037">Ejemplo en C: Creación de hilos con pthread</a></li>
</ul>
</li>
<li><a href="#org0897cc5">Concurrencia y secuenciabilidad</a>
<ul>
<li><a href="#org52d6995">Ejemplo en C: Concurrencia y sincronización de tareas</a></li>
</ul>
</li>
<li><a href="#org01a0cfc">Niveles, objetivos y criterios de planificación</a>
<ul>
<li><a href="#org82d2ad3">Ejemplo en C: Implementación simple de planificación Round Robin</a></li>
</ul>
</li>
<li><a href="#org06477ef">Técnicas de administración del planificador</a>
<ul>
<li><a href="#org55ff33a">Ejemplo en C: Planificación simple basada en prioridades</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgbf9b282" class="outline-2">
<h2 id="orgbf9b282">Concepto de proceso</h2>
<div class="outline-text-2" id="text-orgbf9b282">
<p>
Un proceso es una unidad de ejecución dentro de un sistema
operativo. Cada proceso tiene su propio espacio de memoria, que
incluye el código del programa, sus datos y su pila. La creación de un
proceso implica varias operaciones del sistema operativo, como
asignación de memoria y registro en la tabla de procesos. Los procesos
permiten a los sistemas multitarea ejecutar múltiples programas de
forma aparentemente simultánea.
</p>
</div>
</div>


<div id="outline-container-orgec91301" class="outline-2">
<h2 id="orgec91301">Comandos para manejar procesos en Linux</h2>
<div class="outline-text-2" id="text-orgec91301">
</div>
<div id="outline-container-org7b2f86f" class="outline-3">
<h3 id="org7b2f86f">1. Ver procesos activos</h3>
<div class="outline-text-3" id="text-org7b2f86f">
<ul class="org-ul">
<li>`ps`
Muestra una lista de procesos en la terminal actual. Ofrece información sobre el PID, usuario, CPU, memoria, etc.
<ul class="org-ul">
<li>Ejemplo: `ps aux` muestra todos los procesos en ejecución en el sistema.</li>
</ul></li>

<li>`top` 
Muestra una lista dinámica de procesos en tiempo real, actualizándose constantemente. Incluye el uso de CPU, memoria, y estadísticas del sistema.
<ul class="org-ul">
<li>Comando alternativo: `htop`, que ofrece una interfaz más visual y personalizable.</li>
</ul></li>

<li>`pgrep &lt;nombre&gt;`
Busca el PID (Process ID) de un proceso específico por su nombre. Útil para obtener el PID antes de aplicar otros comandos.
<ul class="org-ul">
<li>Ejemplo: `pgrep apache` muestra el PID del proceso con el nombre "apache".</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcca7250" class="outline-3">
<h3 id="orgcca7250">2. Iniciar procesos</h3>
<div class="outline-text-3" id="text-orgcca7250">
<ul class="org-ul">
<li>`&amp;` 
Ejecuta un comando en segundo plano, permitiendo que el usuario continúe usando la terminal. 
<ul class="org-ul">
<li>Ejemplo: `comando &amp;` ejecuta el proceso en segundo plano.</li>
</ul></li>

<li>`nohup &lt;comando&gt; &amp;`
Inicia un proceso que continúa en ejecución incluso después de cerrar la terminal. El output se guarda en un archivo `nohup.out` por defecto.
<ul class="org-ul">
<li>Ejemplo: `nohup script.sh &amp;` ejecuta `script.sh` y permanece activo tras cerrar sesión.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb266fa" class="outline-3">
<h3 id="orgeb266fa">3. Controlar la ejecución de procesos</h3>
<div class="outline-text-3" id="text-orgeb266fa">
<ul class="org-ul">
<li>`fg` 
Trae un proceso en segundo plano al primer plano, permitiendo interactuar directamente con él.</li>

<li>`bg`
Envía un proceso suspendido al segundo plano, liberando la terminal para otros comandos.</li>

<li>`jobs`
Muestra los procesos en segundo plano o suspendidos asociados a la sesión de terminal actual, con su ID de trabajo (job ID).</li>
</ul>
</div>
</div>

<div id="outline-container-org9283f45" class="outline-3">
<h3 id="org9283f45">4. Enviar señales a los procesos</h3>
<div class="outline-text-3" id="text-org9283f45">
<ul class="org-ul">
<li>`kill &lt;PID&gt;` 
Envía una señal de terminación al proceso especificado por su PID. Intenta cerrar el proceso de manera controlada.
<ul class="org-ul">
<li>Ejemplo: `kill 1234` termina el proceso con PID 1234.</li>
</ul></li>

<li>`kill -9 &lt;PID&gt;`
Fuerza el cierre inmediato del proceso especificado, sin esperar una terminación ordenada. Utiliza la señal `KILL`.
<ul class="org-ul">
<li>Ejemplo: `kill -9 1234`.</li>
</ul></li>

<li>`pkill &lt;nombre&gt;`
Termina todos los procesos que coinciden con el nombre especificado.
<ul class="org-ul">
<li>Ejemplo: `pkill apache` detiene todos los procesos con nombre "apache".</li>
</ul></li>

<li>`killall &lt;nombre&gt;`
Similar a `pkill`, detiene todos los procesos con un nombre específico.
<ul class="org-ul">
<li>Ejemplo: `killall httpd`.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf3e8981" class="outline-3">
<h3 id="orgf3e8981">5. Cambiar prioridad de procesos</h3>
<div class="outline-text-3" id="text-orgf3e8981">
<ul class="org-ul">
<li>`nice -n &lt;prioridad&gt; &lt;comando&gt;`
Inicia un proceso con una prioridad especificada, donde el rango va de -20 (mayor prioridad) a 19 (menor prioridad). La prioridad afecta el orden de planificación.
<ul class="org-ul">
<li>Ejemplo: `nice -n -10 script.sh` ejecuta `script.sh` con una prioridad alta.</li>
</ul></li>

<li>`renice &lt;prioridad&gt; &lt;PID&gt;`
Cambia la prioridad de un proceso en ejecución.
<ul class="org-ul">
<li>Ejemplo: `renice -5 1234` ajusta la prioridad del proceso con PID 1234.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org648fa79" class="outline-3">
<h3 id="org648fa79">6. Ver detalles específicos de los procesos</h3>
<div class="outline-text-3" id="text-org648fa79">
<ul class="org-ul">
<li>`pstree`
Muestra los procesos en una estructura de árbol, permitiendo visualizar mejor las relaciones y jerarquías entre procesos en ejecución.</li>

<li>`lsof -p &lt;PID&gt;`
Lista todos los archivos abiertos por un proceso específico, útil para ver conexiones de red o archivos utilizados por un proceso.
<ul class="org-ul">
<li>Ejemplo: `lsof -p 1234` muestra los archivos abiertos por el proceso con PID 1234.</li>
</ul></li>
</ul>
</div>
</div>



<div id="outline-container-org83bae99" class="outline-3">
<h3 id="org83bae99">Ejemplo en C: Creación de un proceso utilizando fork()</h3>
<div class="outline-text-3" id="text-org83bae99">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">unistd.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">sys/types.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">pid_t</span> <span style="color: #ff98a4;">pid</span> = fork<span style="color: #ff995e;">()</span>; <span style="color: #7a88cf;">// </span><span style="color: #7a88cf;">Crear un nuevo proceso</span>
    <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>pid == 0<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
        printf<span style="color: #ff98a4;">(</span><span style="color: #c3e88d;">"Soy el proceso hijo con PID %d\n"</span>, getpid<span style="color: #b4f9f8;">()</span><span style="color: #ff98a4;">)</span>;
    <span style="color: #ff995e;">}</span> <span style="color: #c099ff;">else</span> <span style="color: #ff995e;">{</span>
        printf<span style="color: #ff98a4;">(</span><span style="color: #c3e88d;">"Soy el proceso padre con PID %d\n"</span>, getpid<span style="color: #b4f9f8;">()</span><span style="color: #ff98a4;">)</span>;
    <span style="color: #ff995e;">}</span>
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
</div>
