so.org
* Estados y transiciones de los procesos
Los procesos en un sistema operativo pueden estar en diferentes
estados, que determinan si están utilizando la CPU, esperando, o
listos para ejecutarse. Los estados comunes incluyen:
  - **Nuevo**: El proceso está siendo creado.
  - **Listo**: El proceso está listo para ejecutarse.
  - **Ejecución**: El proceso está ejecutándose en la CPU.
  - **Bloqueado**: El proceso está esperando un evento externo (por ejemplo, entrada/salida).
  - **Terminado**: El proceso ha completado su ejecución.

Los sistemas operativos gestionan estas transiciones mediante una estructura de datos llamada tabla de procesos.

** Ejemplo en C: Simulación de transiciones de estados
#+BEGIN_SRC C :results output
#include <stdio.h>
#include <unistd.h>
#include <stdlib.h>
#include <sys/wait.h>

int main() {
    printf("Proceso creado\n");
    pid_t pid = fork();
    if (pid == 0) {
        printf("Estado: Ejecución - Proceso hijo\n");
        sleep(2); // Simula un proceso en espera (bloqueado)
        printf("Estado: Terminado - Proceso hijo\n");
        exit(0);
    } else {
        printf("Estado: Listo - Proceso padre\n");
        wait(NULL); // Espera a que el proceso hijo finalice
        printf("Estado: Terminado - Proceso padre\n");
    }
    return 0;
}
#+END_SRC

#+RESULTS:
: Proceso creado
: Estado: Ejecución - Proceso hijo
: Estado: Terminado - Proceso hijo
: Proceso creado
: Estado: Listo - Proceso padre
: Estado: Terminado - Proceso padre

* Procesos ligeros: Hilos o hebras

Un proceso ligero o hilo es una unidad de ejecución que comparte el
mismo espacio de memoria que otros hilos dentro del mismo proceso. Los
hilos permiten paralelizar tareas en un programa y mejorar la
eficiencia sin crear procesos separados. Los sistemas operativos
modernos proporcionan bibliotecas como POSIX threads (pthreads) para
crear y gestionar hilos.

** Ejemplo en C: Creación de hilos con pthread
#+BEGIN_SRC C
#include <pthread.h>
#include <stdio.h>

void* tarea(void* arg) {
    printf("Hilo en ejecución\n");
    return NULL;
}

int main() {
    pthread_t hilo1, hilo2;
    pthread_create(&hilo1, NULL, tarea, NULL);
    pthread_create(&hilo2, NULL, tarea, NULL);

    pthread_join(hilo1, NULL);
    pthread_join(hilo2, NULL);
    printf("Todos los hilos han terminado\n");
    return 0;
}
#+END_SRC

* Concurrencia y secuenciabilidad
La concurrencia permite ejecutar múltiples tareas "simultáneamente". Aunque no siempre se ejecutan al mismo tiempo, se pueden intercalar en un mismo procesador mediante interrupciones y cambios de contexto. La secuenciabilidad define un orden en estas tareas concurrentes, permitiendo que se ejecute un bloque de código mientras otro espera, garantizando la sincronización.

** Ejemplo en C: Concurrencia y sincronización de tareas
#+BEGIN_SRC C
#include <pthread.h>
#include <stdio.h>
#include <unistd.h>

void* tarea1(void* arg) {
    printf("Inicio de tarea 1\n");
    sleep(1);
    printf("Fin de tarea 1\n");
    return NULL;
}

void* tarea2(void* arg) {
    printf("Inicio de tarea 2\n");
    sleep(1);
    printf("Fin de tarea 2\n");
    return NULL;
}

int main() {
    pthread_t hilo1, hilo2;
    pthread_create(&hilo1, NULL, tarea1, NULL);
    pthread_create(&hilo2, NULL, tarea2, NULL);

    pthread_join(hilo1, NULL);
    pthread_join(hilo2, NULL);
    printf("Ambas tareas han terminado de forma concurrente\n");
    return 0;
}
#+END_SRC

* Niveles, objetivos y criterios de planificación
La planificación es el proceso de asignar recursos del sistema a los procesos. Existen varios niveles:
  - **Planificación a largo plazo**: Selecciona qué procesos ingresar al sistema.
  - **Planificación a medio plazo**: Decide qué procesos en espera se vuelven listos.
  - **Planificación a corto plazo**: Selecciona qué proceso listo ocupará la CPU.

Los criterios de planificación pueden incluir la equidad, la eficiencia y el tiempo de respuesta.

