index.html

<div id="outline-container-orgce010df" class="outline-2">
<h2 id="orgce010df">Estados y transiciones de los procesos</h2>
<div class="outline-text-2" id="text-orgce010df">
<p>
Los procesos en un sistema operativo pueden estar en diferentes estados, que determinan si están utilizando la CPU, esperando, o listos para ejecutarse. Los estados comunes incluyen:
</p>
<ul class="org-ul">
<li><b><b>Nuevo</b></b>: El proceso está siendo creado.</li>
<li><b><b>Listo</b></b>: El proceso está listo para ejecutarse.</li>
<li><b><b>Ejecución</b></b>: El proceso está ejecutándose en la CPU.</li>
<li><b><b>Bloqueado</b></b>: El proceso está esperando un evento externo (por ejemplo, entrada/salida).</li>
<li><b><b>Terminado</b></b>: El proceso ha completado su ejecución.</li>
</ul>

<p>
Los sistemas operativos gestionan estas transiciones mediante una estructura de datos llamada tabla de procesos.
</p>
</div>

<div id="outline-container-org8eeef8e" class="outline-3">
<h3 id="org8eeef8e">Ejemplo en C: Simulación de transiciones de estados</h3>
<div class="outline-text-3" id="text-org8eeef8e">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">unistd.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdlib.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">sys/wait.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Proceso creado\n"</span><span style="color: #ff995e;">)</span>;
    <span style="color: #ffc777;">pid_t</span> <span style="color: #ff98a4;">pid</span> = fork<span style="color: #ff995e;">()</span>;
    <span style="color: #c099ff;">if</span> <span style="color: #ff995e;">(</span>pid == 0<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
        printf<span style="color: #ff98a4;">(</span><span style="color: #c3e88d;">"Estado: Ejecuci&#243;n - Proceso hijo\n"</span><span style="color: #ff98a4;">)</span>;
        sleep<span style="color: #ff98a4;">(</span>2<span style="color: #ff98a4;">)</span>; <span style="color: #7a88cf;">// </span><span style="color: #7a88cf;">Simula un proceso en espera (bloqueado)</span>
        printf<span style="color: #ff98a4;">(</span><span style="color: #c3e88d;">"Estado: Terminado - Proceso hijo\n"</span><span style="color: #ff98a4;">)</span>;
        exit<span style="color: #ff98a4;">(</span>0<span style="color: #ff98a4;">)</span>;
    <span style="color: #ff995e;">}</span> <span style="color: #c099ff;">else</span> <span style="color: #ff995e;">{</span>
        printf<span style="color: #ff98a4;">(</span><span style="color: #c3e88d;">"Estado: Listo - Proceso padre\n"</span><span style="color: #ff98a4;">)</span>;
        wait<span style="color: #ff98a4;">(</span><span style="color: #ff995e;">NULL</span><span style="color: #ff98a4;">)</span>; <span style="color: #7a88cf;">// </span><span style="color: #7a88cf;">Espera a que el proceso hijo finalice</span>
        printf<span style="color: #ff98a4;">(</span><span style="color: #c3e88d;">"Estado: Terminado - Proceso padre\n"</span><span style="color: #ff98a4;">)</span>;
    <span style="color: #ff995e;">}</span>
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcc24b89" class="outline-2">
<h2 id="orgcc24b89">Procesos ligeros: Hilos o hebras</h2>
<div class="outline-text-2" id="text-orgcc24b89">
<p>
Un proceso ligero o hilo es una unidad de ejecución que comparte el mismo espacio de memoria que otros hilos dentro del mismo proceso. Los hilos permiten paralelizar tareas en un programa y mejorar la eficiencia sin crear procesos separados. Los sistemas operativos modernos proporcionan bibliotecas como POSIX threads (pthreads) para crear y gestionar hilos.
</p>
</div>

<div id="outline-container-org17e2037" class="outline-3">
<h3 id="org17e2037">Ejemplo en C: Creación de hilos con pthread</h3>
<div class="outline-text-3" id="text-org17e2037">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">pthread.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #ffc777;">void</span>* <span style="color: #82aaff;">tarea</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">void</span>* <span style="color: #ff98a4;">arg</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Hilo en ejecuci&#243;n\n"</span><span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">NULL</span>;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">pthread_t</span> <span style="color: #ff98a4;">hilo1</span>, <span style="color: #ff98a4;">hilo2</span>;
    pthread_create<span style="color: #ff995e;">(</span>&amp;hilo1, <span style="color: #ff995e;">NULL</span>, tarea, <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span>;
    pthread_create<span style="color: #ff995e;">(</span>&amp;hilo2, <span style="color: #ff995e;">NULL</span>, tarea, <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span>;

    pthread_join<span style="color: #ff995e;">(</span>hilo1, <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span>;
    pthread_join<span style="color: #ff995e;">(</span>hilo2, <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span>;
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Todos los hilos han terminado\n"</span><span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0897cc5" class="outline-2">
<h2 id="org0897cc5">Concurrencia y secuenciabilidad</h2>
<div class="outline-text-2" id="text-org0897cc5">
<p>
La concurrencia permite ejecutar múltiples tareas "simultáneamente". Aunque no siempre se ejecutan al mismo tiempo, se pueden intercalar en un mismo procesador mediante interrupciones y cambios de contexto. La secuenciabilidad define un orden en estas tareas concurrentes, permitiendo que se ejecute un bloque de código mientras otro espera, garantizando la sincronización.
</p>
</div>

<div id="outline-container-org52d6995" class="outline-3">
<h3 id="org52d6995">Ejemplo en C: Concurrencia y sincronización de tareas</h3>
<div class="outline-text-3" id="text-org52d6995">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">pthread.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">unistd.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #ffc777;">void</span>* <span style="color: #82aaff;">tarea1</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">void</span>* <span style="color: #ff98a4;">arg</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Inicio de tarea 1\n"</span><span style="color: #ff995e;">)</span>;
    sleep<span style="color: #ff995e;">(</span>1<span style="color: #ff995e;">)</span>;
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Fin de tarea 1\n"</span><span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">NULL</span>;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">void</span>* <span style="color: #82aaff;">tarea2</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">void</span>* <span style="color: #ff98a4;">arg</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Inicio de tarea 2\n"</span><span style="color: #ff995e;">)</span>;
    sleep<span style="color: #ff995e;">(</span>1<span style="color: #ff995e;">)</span>;
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Fin de tarea 2\n"</span><span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">return</span> <span style="color: #ff995e;">NULL</span>;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">pthread_t</span> <span style="color: #ff98a4;">hilo1</span>, <span style="color: #ff98a4;">hilo2</span>;
    pthread_create<span style="color: #ff995e;">(</span>&amp;hilo1, <span style="color: #ff995e;">NULL</span>, tarea1, <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span>;
    pthread_create<span style="color: #ff995e;">(</span>&amp;hilo2, <span style="color: #ff995e;">NULL</span>, tarea2, <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span>;

    pthread_join<span style="color: #ff995e;">(</span>hilo1, <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span>;
    pthread_join<span style="color: #ff995e;">(</span>hilo2, <span style="color: #ff995e;">NULL</span><span style="color: #ff995e;">)</span>;
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Ambas tareas han terminado de forma concurrente\n"</span><span style="color: #ff995e;">)</span>;
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org01a0cfc" class="outline-2">
<h2 id="org01a0cfc">Niveles, objetivos y criterios de planificación</h2>
<div class="outline-text-2" id="text-org01a0cfc">
<p>
La planificación es el proceso de asignar recursos del sistema a los procesos. Existen varios niveles:
</p>
<ul class="org-ul">
<li><b><b>Planificación a largo plazo</b></b>: Selecciona qué procesos ingresar al sistema.</li>
<li><b><b>Planificación a medio plazo</b></b>: Decide qué procesos en espera se vuelven listos.</li>
<li><b><b>Planificación a corto plazo</b></b>: Selecciona qué proceso listo ocupará la CPU.</li>
</ul>

<p>
Los criterios de planificación pueden incluir la equidad, la eficiencia y el tiempo de respuesta.
</p>
</div>
