so.org
** Ejemplo en C: Implementación simple de planificación Round Robin
#+BEGIN_SRC C
#include <stdio.h>
#include <unistd.h>

void proceso(int id) {
    printf("Proceso %d en ejecución\n", id);
    sleep(1); // Tiempo simulado de ejecución del proceso
    printf("Proceso %d terminado\n", id);
}

int main() {
    int n_procesos = 3;
    for (int i = 0; i < n_procesos; i++) {
        proceso(i);
    }
    return 0;
}
#+END_SRC

* Técnicas de administración del planificador
El planificador utiliza varias técnicas para mejorar la gestión de procesos:
  - **Round Robin**: Asigna a cada proceso una franja de tiempo.
  - **Prioridad**: Da preferencia a procesos con alta prioridad.
  - **Planificación en tiempo real**: Asegura que tareas críticas se ejecuten en el momento correcto.

** Ejemplo en C: Planificación simple basada en prioridades
#+BEGIN_SRC C
#include <stdio.h>
#include <stdlib.h>

typedef struct {
    int id;
    int prioridad;
} Proceso;

void ejecutar(Proceso p) {
    printf("Ejecutando proceso %d con prioridad %d\n", p.id, p.prioridad);
}

int main() {
    Proceso procesos[] = {{1, 2}, {2, 1}, {3, 3}};
    int n = sizeof(procesos) / sizeof(procesos[0]);

    // Ordenar procesos por prioridad
    for (int i = 0; i < n - 1; i++) {
        for (int j = i + 1; j < n; j++) {
            if (procesos[i].prioridad > procesos[j].prioridad) {
                Proceso temp = procesos[i];
                procesos[i] = procesos[j];
                procesos[j] = temp;
            }
        }
    }

    for (int i = 0; i < n; i++) {
        ejecutar(procesos[i]);
    }

    return 0;
}
#+END_SRC
