index.html

<div id="outline-container-org82d2ad3" class="outline-3">
<h3 id="org82d2ad3">Ejemplo en C: Implementación simple de planificación Round Robin</h3>
<div class="outline-text-3" id="text-org82d2ad3">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">unistd.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #ffc777;">void</span> <span style="color: #82aaff;">proceso</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">id</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Proceso %d en ejecuci&#243;n\n"</span>, id<span style="color: #ff995e;">)</span>;
    sleep<span style="color: #ff995e;">(</span>1<span style="color: #ff995e;">)</span>; <span style="color: #7a88cf;">// </span><span style="color: #7a88cf;">Tiempo simulado de ejecuci&#243;n del proceso</span>
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Proceso %d terminado\n"</span>, id<span style="color: #ff995e;">)</span>;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">n_procesos</span> = 3;
    <span style="color: #c099ff;">for</span> <span style="color: #ff995e;">(</span><span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">i</span> = 0; i &lt; n_procesos; i++<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
        proceso<span style="color: #ff98a4;">(</span>i<span style="color: #ff98a4;">)</span>;
    <span style="color: #ff995e;">}</span>
    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org06477ef" class="outline-2">
<h2 id="org06477ef">Técnicas de administración del planificador</h2>
<div class="outline-text-2" id="text-org06477ef">
<p>
El planificador utiliza varias técnicas para mejorar la gestión de procesos:
</p>
<ul class="org-ul">
<li><b><b>Round Robin</b></b>: Asigna a cada proceso una franja de tiempo.</li>
<li><b><b>Prioridad</b></b>: Da preferencia a procesos con alta prioridad.</li>
<li><b><b>Planificación en tiempo real</b></b>: Asegura que tareas críticas se ejecuten en el momento correcto.</li>
</ul>
</div>

<div id="outline-container-org55ff33a" class="outline-3">
<h3 id="org55ff33a">Ejemplo en C: Planificación simple basada en prioridades</h3>
<div class="outline-text-3" id="text-org55ff33a">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdio.h</span><span style="color: #c099ff;">&gt;</span>
<span style="color: #86e1fc; font-weight: bold;">#include</span> <span style="color: #c099ff;">&lt;</span><span style="color: #c3e88d;">stdlib.h</span><span style="color: #c099ff;">&gt;</span>

<span style="color: #c099ff;">typedef</span> <span style="color: #c099ff;">struct</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">id</span>;
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">prioridad</span>;
<span style="color: #c099ff;">}</span> <span style="color: #ffc777;">Proceso</span>;

<span style="color: #ffc777;">void</span> <span style="color: #82aaff;">ejecutar</span><span style="color: #c099ff;">(</span><span style="color: #ffc777;">Proceso</span> <span style="color: #ff98a4;">p</span><span style="color: #c099ff;">)</span> <span style="color: #c099ff;">{</span>
    printf<span style="color: #ff995e;">(</span><span style="color: #c3e88d;">"Ejecutando proceso %d con prioridad %d\n"</span>, p.id, p.prioridad<span style="color: #ff995e;">)</span>;
<span style="color: #c099ff;">}</span>

<span style="color: #ffc777;">int</span> <span style="color: #82aaff;">main</span><span style="color: #c099ff;">()</span> <span style="color: #c099ff;">{</span>
    <span style="color: #ffc777;">Proceso</span> <span style="color: #ff98a4;">procesos</span><span style="color: #ff995e;">[]</span> = <span style="color: #ff995e;">{</span><span style="color: #ff98a4;">{</span>1, 2<span style="color: #ff98a4;">}</span>, <span style="color: #ff98a4;">{</span>2, 1<span style="color: #ff98a4;">}</span>, <span style="color: #ff98a4;">{</span>3, 3<span style="color: #ff98a4;">}</span><span style="color: #ff995e;">}</span>;
    <span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">n</span> = <span style="color: #c099ff;">sizeof</span><span style="color: #ff995e;">(</span>procesos<span style="color: #ff995e;">)</span> / <span style="color: #c099ff;">sizeof</span><span style="color: #ff995e;">(</span>procesos<span style="color: #ff98a4;">[</span>0<span style="color: #ff98a4;">]</span><span style="color: #ff995e;">)</span>;

    <span style="color: #7a88cf;">// </span><span style="color: #7a88cf;">Ordenar procesos por prioridad</span>
    <span style="color: #c099ff;">for</span> <span style="color: #ff995e;">(</span><span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">i</span> = 0; i &lt; n - 1; i++<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
        <span style="color: #c099ff;">for</span> <span style="color: #ff98a4;">(</span><span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">j</span> = i + 1; j &lt; n; j++<span style="color: #ff98a4;">)</span> <span style="color: #ff98a4;">{</span>
            <span style="color: #c099ff;">if</span> <span style="color: #b4f9f8;">(</span>procesos<span style="color: #f989d3;">[</span>i<span style="color: #f989d3;">]</span>.prioridad &gt; procesos<span style="color: #f989d3;">[</span>j<span style="color: #f989d3;">]</span>.prioridad<span style="color: #b4f9f8;">)</span> <span style="color: #b4f9f8;">{</span>
                <span style="color: #ffc777;">Proceso</span> <span style="color: #ff98a4;">temp</span> = procesos<span style="color: #f989d3;">[</span>i<span style="color: #f989d3;">]</span>;
                procesos<span style="color: #f989d3;">[</span>i<span style="color: #f989d3;">]</span> = procesos<span style="color: #f989d3;">[</span>j<span style="color: #f989d3;">]</span>;
                procesos<span style="color: #f989d3;">[</span>j<span style="color: #f989d3;">]</span> = temp;
            <span style="color: #b4f9f8;">}</span>
        <span style="color: #ff98a4;">}</span>
    <span style="color: #ff995e;">}</span>

    <span style="color: #c099ff;">for</span> <span style="color: #ff995e;">(</span><span style="color: #ffc777;">int</span> <span style="color: #ff98a4;">i</span> = 0; i &lt; n; i++<span style="color: #ff995e;">)</span> <span style="color: #ff995e;">{</span>
        ejecutar<span style="color: #ff98a4;">(</span>procesos<span style="color: #b4f9f8;">[</span>i<span style="color: #b4f9f8;">]</span><span style="color: #ff98a4;">)</span>;
    <span style="color: #ff995e;">}</span>

    <span style="color: #c099ff;">return</span> 0;
<span style="color: #c099ff;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: likcos</p>
<p class="date">Created: 2024-10-29 mar 14:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
